Tekla Open API Reference for Tekla Structures 2025
Circle Properties
The Circle type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the circle.
CenterPoint
 The center point of the circle.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from GraphicObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Radius
 The radius of the circle.
Top
See Also
Reference
Circle Class
Tekla.Structures.Drawing Namespace